<a href="https://colab.research.google.com/github/Ilya38rus/Pis05/blob/main/Untitled1.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Заголовок

## Import Package

In [3]:
import pandas as pd
import numpy as np
from IPython.display import display

In [4]:
data = pd.read_csv("https://archive.ics.uci.edu/ml/machine-learning-databases/glass/glass.data")

data.head(3)

   1  1.52101  13.64  4.49  1.10  71.78  0.06  8.75  0.00  0.00.1  1.1
0  2  1.51761  13.89  3.60  1.36  72.73  0.48  7.83   0.0     0.0    1
1  3  1.51618  13.53  3.55  1.54  72.99  0.39  7.78   0.0     0.0    1
2  4  1.51766  13.21  3.69  1.29  72.61  0.57  8.22   0.0     0.0    1

In [7]:
names = ("id","RI", "NA", "MG", "AL", "Si", "K", "Ca", "Ba",  "Fe", "Class")
data.columns = names
data = data.drop(columns=('id'))
data.head(3)

        RI     NA    MG    AL     Si     K    Ca   Ba   Fe  Class
0  1.51761  13.89  3.60  1.36  72.73  0.48  7.83  0.0  0.0      1
1  1.51618  13.53  3.55  1.54  72.99  0.39  7.78  0.0  0.0      1
2  1.51766  13.21  3.69  1.29  72.61  0.57  8.22  0.0  0.0      1

In [15]:
data['Class'].replace ({1: "building_windows_float",
                        2: "building_windows_non_float",
                        3: "vehicle_windows_float_processed",
                        4: "vehicle_windows_non_float_processed (none in this database)",
                        5: "containers", 
                        6: "tableware", 
                      7: "headlamps"}, inplace=True)
data.head(7)

        RI     NA    MG    AL  ...    Ca   Ba    Fe                   Class
0  1.51761  13.89  3.60  1.36  ...  7.83  0.0  0.00  building_windows_float
1  1.51618  13.53  3.55  1.54  ...  7.78  0.0  0.00  building_windows_float
2  1.51766  13.21  3.69  1.29  ...  8.22  0.0  0.00  building_windows_float
3  1.51742  13.27  3.62  1.24  ...  8.07  0.0  0.00  building_windows_float
4  1.51596  12.79  3.61  1.62  ...  8.07  0.0  0.26  building_windows_float
5  1.51743  13.30  3.60  1.14  ...  8.17  0.0  0.00  building_windows_float
6  1.51756  13.15  3.61  1.05  ...  8.24  0.0  0.00  building_windows_float

[7 rows x 10 columns]

In [ ]:
for col in data.columns:
  fr = np.random.randint(5,10)/100
  data.loc[data.sample(frac=fr).index, col] = np.nan

# data Vizualization

In [ ]:
data.info()

In [ ]:
data.describe()

In [23]:
display( data['Class'].describe() )
print ("---------------------------")
display( data['Class'].value_counts())

count                        160
unique                         6
top       building_windows_float
freq                          55
Name: Class, dtype: object

---------------------------

building_windows_float             55
building_windows_non_float         55
headlamps                          21
vehicle_windows_float_processed    13
containers                          9
tableware                           7
Name: Class, dtype: int64